In [1]:
CHRONOS = "autogluon/chronos_datasets"
DATASET_CHRONOS = [
    "dominick",
    "ercot",
    "exchange_rate",
    #"monash_m3_monthly"
]

In [2]:
from datasets import load_dataset

In [3]:
for dataset in DATASET_CHRONOS:
    ds = load_dataset(CHRONOS, dataset, trust_remote_code=True)
    display(ds)

DatasetDict({
    train: Dataset({
        features: ['id', 'timestamp', 'target', 'im_0'],
        num_rows: 100014
    })
})

DatasetDict({
    train: Dataset({
        features: ['id', 'timestamp', 'target'],
        num_rows: 8
    })
})

DatasetDict({
    train: Dataset({
        features: ['id', 'timestamp', 'target'],
        num_rows: 8
    })
})

In [4]:
import pandas as pd

dominick_ds = load_dataset(CHRONOS, "dominick", trust_remote_code=True)
examples = [x for x in dominick_ds["train"]]
dominick_df = pd.DataFrame(examples)
dominick_df

,id,timestamp,target,im_0
0,T000000,"[1989-09-14 00:00:00, 1989-09-21 00:00:00, 198...","[40.209999084472656, 40.209999084472656, 0.0, ...",3459
1,T000001,"[1989-09-14 00:00:00, 1989-09-21 00:00:00, 198...","[22.81999969482422, 22.81999969482422, 0.0, 22...",1762
2,T000002,"[1989-09-14 00:00:00, 1989-09-21 00:00:00, 198...","[58.93000030517578, 58.93000030517578, 52.3300...",330
3,T000003,"[1989-09-14 00:00:00, 1989-09-21 00:00:00, 198...","[18.59000015258789, 0.0, 0.0, 0.0, 18.59000015...",4120
4,T000004,"[1989-09-14 00:00:00, 1989-09-21 00:00:00, 198...","[26.639999389648438, 26.639999389648438, 0.0, ...",1665
...,...,...,...,...
100009,T100009,"[1989-09-14 00:00:00, 1989-09-21 00:00:00, 198...","[13.449999809265137, 20.1200008392334, 20.1200...",3881
100010,T100010,"[1989-09-14 00:00:00, 1989-09-21 00:00:00, 198...","[40.66999816894531, 40.66999816894531, 40.6699...",2467
100011,T100011,"[1989-09-14 00:00:00, 1989-09-21 00:00:00, 198...","[42.380001068115234, 42.380001068115234, 38.99...",2569
100012,T100012,"[1989-09-14 00:00:00, 1989-09-21 00:00:00, 198...","[40.20000076293945, 40.20000076293945, 40.2000...",2324
100013,T100013,"[1989-09-14 00:00:00, 1989-09-21 00:00:00, 198...","[42.88999938964844, 42.88999938964844, 42.8899...",2375

In [5]:
ercot_ds = load_dataset(CHRONOS, "ercot", trust_remote_code=True)
examples = [x for x in ercot_ds["train"]]
ercot_df = pd.DataFrame(examples)
ercot_df

,id,timestamp,target
0,COAST,"[2004-01-01 01:00:00, 2004-01-01 02:00:00, 200...","[7225.08984375, 6994.25, 6717.419921875, 6554...."
1,EAST,"[2004-01-01 01:00:00, 2004-01-01 02:00:00, 200...","[877.7899780273438, 850.75, 831.6300048828125,..."
2,FAR_WEST,"[2004-01-01 01:00:00, 2004-01-01 02:00:00, 200...","[1044.8900146484375, 1032.0400390625, 1021.099..."
3,NORTH,"[2004-01-01 01:00:00, 2004-01-01 02:00:00, 200...","[745.7899780273438, 721.3400268554688, 699.700..."
4,NORTH_C,"[2004-01-01 01:00:00, 2004-01-01 02:00:00, 200...","[7124.2099609375, 6854.580078125, 6639.4799804..."
5,SOUTHERN,"[2004-01-01 01:00:00, 2004-01-01 02:00:00, 200...","[1660.449951171875, 1603.52001953125, 1527.989..."
6,SOUTH_C,"[2004-01-01 01:00:00, 2004-01-01 02:00:00, 200...","[3639.1201171875, 3495.159912109375, 3322.6999..."
7,WEST,"[2004-01-01 01:00:00, 2004-01-01 02:00:00, 200...","[654.6099853515625, 639.8800048828125, 623.419..."

In [6]:
exchange_rate_ds = load_dataset(CHRONOS, "exchange_rate", trust_remote_code=True)
examples = [x for x in exchange_rate_ds["train"]]
exchange_rate_df = pd.DataFrame(examples)
exchange_rate_df

,id,timestamp,target
0,currency_1,"[1990-01-01 00:00:00, 1990-01-02 00:00:00, 199...","[0.7854999899864197, 0.7817999720573425, 0.786..."
1,currency_2,"[1990-01-01 00:00:00, 1990-01-02 00:00:00, 199...","[1.6109999418258667, 1.6100000143051147, 1.629..."
2,currency_3,"[1990-01-01 00:00:00, 1990-01-02 00:00:00, 199...","[0.8616979718208313, 0.8611040115356445, 0.861..."
3,currency_4,"[1990-01-01 00:00:00, 1990-01-02 00:00:00, 199...","[0.6341959834098816, 0.6335129737854004, 0.648..."
4,currency_5,"[1990-01-01 00:00:00, 1990-01-02 00:00:00, 199...","[0.21124200522899628, 0.21124200522899628, 0.2..."
5,currency_6,"[1990-01-01 00:00:00, 1990-01-02 00:00:00, 199...","[0.006837999913841486, 0.006862999871373177, 0..."
6,currency_7,"[1990-01-01 00:00:00, 1990-01-02 00:00:00, 199...","[0.5929999947547913, 0.593999981880188, 0.5972..."
7,currency_8,"[1990-01-01 00:00:00, 1990-01-02 00:00:00, 199...","[0.5254859924316406, 0.5239719748497009, 0.526..."

In [7]:
dominick_df.to_csv("data/chronos_data/dominick.csv")
ercot_df.to_csv("data/chronos_data/ercot.csv")
exchange_rate_df.to_csv("data/chronos_data/exchange_rate.csv")

In [9]:
from gift_eval.data import Dataset

# Load the dataset
to_univariate = False  # Whether to convert the data to univariate
term = "short"

dataset = Dataset(name="jena_weather/10T", term=term, to_univariate=to_univariate)
display(dataset)

In [15]:
dataset.training_dataset

TrainingDataset(dataset=Map(fn=Compose(<gluonts.dataset.common.ProcessDataEntry object at 0x00000233E2BF3250>, <function itemize_start at 0x00000233F90D3880>), iterable=Dataset({
    features: ['item_id', 'start', 'freq', 'target'],
    num_rows: 1
})), splitter=OffsetSplitter(offset=-1008))

In [16]:
exchange_rate_ds["train"] # equivalente di: dataset.training_dataset di GiftEval

Dataset({
    features: ['id', 'timestamp', 'target'],
    num_rows: 8
})

In [17]:
dataset.test_data

TestData(dataset=Map(fn=Compose(<gluonts.dataset.common.ProcessDataEntry object at 0x00000233E2BF3250>, <function itemize_start at 0x00000233F90D3880>), iterable=Dataset({
    features: ['item_id', 'start', 'freq', 'target'],
    num_rows: 1
})), splitter=OffsetSplitter(offset=-960), prediction_length=48, windows=20, distance=48, max_history=None)